alekseibutiaev/experience/keyboard3/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
    /* Decode endpoint IN and OUT address from interface descriptor */
    for (num = 0U; num < max_ep; num++)
    {
      if (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress & 0x80U)
      {
        HID_Handle->InEp = (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress);
        HID_Handle->InPipe = USBH_AllocPipe(phost, HID_Handle->InEp);

        /* Open pipe for IN endpoint */
        USBH_OpenPipe(phost, HID_Handle->InPipe, HID_Handle->InEp, phost->device.address,
                      phost->device.speed, USB_EP_TYPE_INTR, HID_Handle->length);

        USBH_LL_SetToggle(phost, HID_Handle->InPipe, 0U);
      }
      else
      {
        HID_Handle->OutEp = (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress);
        HID_Handle->OutPipe  = USBH_AllocPipe(phost, HID_Handle->OutEp);

        /* Open pipe for OUT endpoint */
        USBH_OpenPipe(phost, HID_Handle->OutPipe, HID_Handle->OutEp, phost->device.address,
                      phost->device.speed, USB_EP_TYPE_INTR, HID_Handle->length);

        USBH_LL_SetToggle(phost, HID_Handle->OutPipe, 0U);
      }
    }
  }
  return USBH_OK;
}

/**
  * @brief  USBH_HID_InterfaceDeInit
  *         The function DeInit the Pipes used for the HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_InterfaceDeInit(USBH_HandleTypeDef *phost) {
  if (phost->pActiveClass->pData) {
    USBH_CfgDescTypeDef* cd = &phost->device.CfgDesc;
    for(uint8_t i = 0; i < cd->bNumInterfaces; ++i) {
      HID_HandleTypeDef* HID_Handle = &((HID_HandleTypeDef*)phost->pActiveClass->pData)[i];

      if (HID_Handle->InPipe != 0x00U)
      {
        USBH_ClosePipe(phost, HID_Handle->InPipe);
        USBH_FreePipe(phost, HID_Handle->InPipe);
        HID_Handle->InPipe = 0U;     /* Reset the pipe as Free */
      }

      if (HID_Handle->OutPipe != 0x00U)
      {
        USBH_ClosePipe(phost, HID_Handle->OutPipe);
        USBH_FreePipe(phost, HID_Handle->OutPipe);
        HID_Handle->OutPipe = 0U;     /* Reset the pipe as Free */
      }
    }
    USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = 0U;
  }
  return USBH_OK;
}

/**
  * @brief  USBH_HID_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost)
{
  uint8_t count = 0;
//  USBH_StatusTypeDef status         = USBH_BUSY;

  USBH_CfgDescTypeDef* cd = &phost->device.CfgDesc;
  for(uint8_t i = 0; i < cd->bNumInterfaces; ++i) {
    HID_HandleTypeDef* HID_Handle = &((HID_HandleTypeDef*)phost->pActiveClass->pData)[i];
    if(HID_Handle->class_status == USBH_OK) {
      if(++count == cd->bNumInterfaces)
        return USBH_OK;
      continue;
    }
//  USBH_UsrLog("%s", __FUNCTION__);

    /* Switch HID state machine */
    switch (HID_Handle->ctl_state)
    {
      case HID_REQ_INIT:
      case HID_REQ_GET_HID_DESC:

        /* Get HID Desc */
        if (USBH_HID_GetHIDDescriptor(phost, USB_HID_DESC_SIZE) == USBH_OK)
        {

          USBH_HID_ParseHIDDesc(&HID_Handle->HID_Desc, phost->device.Data);
          HID_Handle->ctl_state = HID_REQ_GET_REPORT_DESC;
        }

        break;
      case HID_REQ_GET_REPORT_DESC:


        /* Get Report Desc */
        if (USBH_HID_GetHIDReportDescriptor(phost, HID_Handle->HID_Desc.wItemLength) == USBH_OK)
        {
          /* The descriptor is available in phost->device.Data */

          HID_Handle->ctl_state = HID_REQ_SET_IDLE;
        }

        break;

      case HID_REQ_SET_IDLE: {

        USBH_StatusTypeDef classReqStatus = USBH_HID_SetIdle(phost, 0U, 0U);

        /* set Idle */
        if (classReqStatus == USBH_OK)
        {
          HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
        }
        else
        {
          if (classReqStatus == USBH_NOT_SUPPORTED)
          {
            HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
          }
        }
        break;
      }

      case HID_REQ_SET_PROTOCOL:
        /* set protocol */
        if (USBH_HID_SetProtocol(phost, 0U) == USBH_OK)
        {
          HID_Handle->ctl_state = HID_REQ_IDLE;

          /* all requests performed*/
          phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
          HID_Handle->class_status = USBH_OK;
          if(++count == cd->bNumInterfaces)
            return USBH_OK;
        }
        break;

      case HID_REQ_IDLE:
      default:
        break;
    }
  }
  return USBH_BUSY;
}

static char* nstate[] = { "HID_INIT", "HID_IDLE", "HID_SEND_DATA", "HID_BUSY",
    "HID_GET_DATA", "HID_SYNC", "HID_POLL", "HID_ERROR" };

/**
  * @brief  USBH_HID_Process
  *         The function is for managing state machine for HID data transfers
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost)
{
  static uint8_t idx = 0;
  static uint8_t pinterface = 0xff;
  USBH_StatusTypeDef status = USBH_OK;
  uint32_t XferSize;
  USBH_CfgDescTypeDef* cd = &phost->device.CfgDesc;
  HID_HandleTypeDef* HID_Handle = &((HID_HandleTypeDef*)phost->pActiveClass->pData)[idx];
  uint8_t interface = USBH_FindInterface(phost, phost->pActiveClass->ClassCode, HID_BOOT_CODE, cd->Itf_Desc[idx].bInterfaceProtocol);
  if(pinterface != interface) {
    if (USBH_SelectInterface(phost, interface) != USBH_OK)
      return USBH_FAIL;
    pinterface = interface;
  }

  HID_StateTypeDef state  = HID_Handle->state;
  USBH_UsrLog("%s st: %s, %d, idx: %d", __FUNCTION__, nstate[state], state, idx);
  if(state == HID_POLL || idx == 1)
    XferSize = 0;
  switch (state)
  {
    case HID_INIT: {
      HID_Handle->Init(phost);
      HID_Handle->state = HID_IDLE;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      break;
    }
    case HID_IDLE: {
      status = USBH_HID_GetReport(phost, 0x01U, 0U, HID_Handle->pData, (uint8_t)HID_Handle->length);
      if (status == USBH_OK)
      {
        HID_Handle->state = HID_SYNC;
      }
      else if (status == USBH_BUSY)
      {
        HID_Handle->state = HID_IDLE;
        status = USBH_OK;
      }
      else if (status == USBH_NOT_SUPPORTED)
      {
        HID_Handle->state = HID_SYNC;
        status = USBH_OK;
      }
      else
      {
        HID_Handle->state = HID_ERROR;
        status = USBH_FAIL;
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      break;
    }
    case HID_SYNC: {
      /* Sync with start of Even Frame */
      if (phost->Timer & 1U)
      {
        HID_Handle->state = HID_GET_DATA;
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      break;
    }
    case HID_GET_DATA: {
      USBH_InterruptReceiveData(phost, HID_Handle->pData,
                                (uint8_t)HID_Handle->length,
                                HID_Handle->InPipe);

      HID_Handle->state = HID_POLL;
      HID_Handle->timer = phost->Timer;
      HID_Handle->DataReady = 0U;
      break;
    }
    case HID_POLL: {
      USBH_UsrLog("POLL");
      if (USBH_LL_GetURBState(phost, HID_Handle->InPipe) == USBH_URB_DONE)
      {
        XferSize = USBH_LL_GetLastXferSize(phost, HID_Handle->InPipe);

        if ((HID_Handle->DataReady == 0U) && (XferSize != 0U))
        {
          USBH_HID_FifoWrite(&HID_Handle->fifo, HID_Handle->pData, HID_Handle->length);
          HID_Handle->DataReady = 1U;
          USBH_HID_EventCallback(phost);

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
        }
      }
      /* IN Endpoint Stalled */
      else if (USBH_LL_GetURBState(phost, HID_Handle->InPipe) == USBH_URB_STALL) {
        /* Issue Clear Feature on interrupt IN endpoint */
        if (USBH_ClrFeature(phost, HID_Handle->ep_addr) == USBH_OK) {
            /* Change state to issue next IN token */
            HID_Handle->state = HID_GET_DATA;
        }
      }
      else if(phost->RequestState == CMD_WAIT)
        USBH_CtlReq(phost, 0, 0);
      idx = (idx + 1) % cd->bNumInterfaces;
      break;
    }
    default:
      break;
  }

